Project/Toir.Adaptation/src/Documents/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВыявленныеДефекты</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>InformationRegister.торо_ВыявленныеДефекты</registerRecords>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтактноеЛицоИнициатора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаОбнаружения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДефектВыявленВПроцессе</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комиссия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИзМобильного</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="79fbf4a8-8f51-4cef-917b-3e00059df530">
    <name>гкс_Влияние</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e4aede75-6f77-4f7d-9149-2cd4d20b2f34">
    <name>гкс_ДефектОформленПоТАГ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7c71a5eb-8ff5-48ba-99f5-fb9859401460">
    <name>гкс_НомерТАГ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2fadb04b-3aaa-4dd8-b305-d053aced95ae">
    <name>гкс_СрочностьВоздействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e5d0d56b-7671-492d-a748-7b755db0a10d">
    <name>гкс_КачественнаяОценка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>СписокДефектов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДефектВыявленВПроцессе</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаНачалаРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КрайняяДопустимаяДатаЗавершенияРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДефектПричина</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидРемонтов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОкончанияРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОтказавшийЭлемент</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ТиповойДефект</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидДефекта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КритичностьДефекта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДефектОписание</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>300</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ПоследствияДефекта</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НаправлениеНаУстранение</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>300</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ПодразделениеИсполнитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ГарантийныйРемонт</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатыПодбораИзМатрицыОценкиРисков</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ID_Ремонта</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>РезультатВыбора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="0e256218-3632-4e2f-81f1-fbae93c7e394">
    <name>гкс_ФайлыФиксации</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/Enums/торо_ТипыОбъектовRCM/торо_ТипыОбъектовRCM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c3d8e035-da50-4f13-96f3-fb3612d91d8b">
  <name>торо_ТипыОбъектовRCM</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="f02e4c26-aca8-4efa-8aef-cef78c903dd7">
    <name>ФункциональноеМесто</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Project/Toir.Adaptation/src/Enums/торо_ВидыДокументовСогласованияРемонтов/торо_ВидыДокументовСогласованияРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВидыДокументовСогласованияРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="64eb183a-1b76-4429-aa1b-57e4cc199142">
    <name>торо_ВнешнееОснованиеДляРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2b394adb-1ebf-4922-857b-9874b3d4c03e">
    <name>торо_ВыявленныеДефекты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="35f75578-8d2f-4f0e-9148-b77abc4269db">
    <name>торо_ЗаявкаНаРемонт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d0fa16de-b6ee-4c56-8fb4-513c07684830">
    <name>торо_АктОВыполненииЭтапаРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Project/Toir.Adaptation/src/Documents/торо_ВнешнееОснованиеДляРабот/торо_ВнешнееОснованиеДляРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВнешнееОснованиеДляРабот</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ОбследованноеОборудование</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7c58d82d-a608-4033-a56b-11f5b496d2f1">
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="13efe440-7374-4800-b6a4-495744f06814">
      <name>Описание</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/Documents/торо_ВыявленныеДефекты/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
&После("ПриОткрытии")
Процедура гкс_ПриОткрытии(Отказ)
	ПриОткрытииНаСервере(ТекущаяДата());
	// гкс+ [07.23] Деснол 18.07.2023
	// Гкс+[TOIR20-570/TOIR20-576] Зозуля А.В. от 14.04.2025. Удалено:{
	//Если Объект.СписокДефектов.Количество() Тогда
	//ТекущиеДанные = Объект.СписокДефектов[0];
	//Объект.гкс_СрочностьВоздействия = ПолучитьСрочностьВоздействия(ТекущиеДанные.ОтказавшийЭлемент, ТекущиеДанные.КритичностьДефекта);	
	//КонецЕсли;
	// } Гкс-[TOIR20-570/TOIR20-576] Зозуля А.В. от 14.04.2025.
	// гкс- [07.23] Деснол 18.07.2023
	Если ЗначениеЗаполнено(Объект.Ссылка) И Не ЭтотОбъект["ПроведенЕвоБланк"]
		И гкс_ЕвоНуженПоВлиянию(Объект.гкс_Влияние) Тогда 		
		ПодключитьОбработчикОжидания("гкс_ОткрытьЕВО_ЧерезСекунду", 1, Истина);
	КонецЕсли; 
	// Гкс+[TOIR20-454] Зозуля А.В. от 09.10.2024. Добавлено:{
	гкс_ДефектОформленПоТАГПриИзменении(Неопределено);
	// } Гкс-[TOIR20-454] Зозуля А.В. от 09.10.2024.
	
	ЭтотОбъект["гкс_ПодразделениеИсполнительЗаполненПользователем"] =
		ЗначениеЗаполнено(Объект.ПодразделениеИсполнитель);
		
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере(ДатаКлиента)
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда 
		Объект.Дата = ТекущаяДата();
	КонецЕсли;
	// гкс+ [Часовые пояса] Куст 
	гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПКлиента(ЭтаФорма,,,);
	// Заголовок формы
	торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект, ЭтаФорма, "");
КонецПроцедуры

&НаСервере
&После("ПередЗаписьюНаСервере")
Процедура гкс_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// гкс+ [Часовые пояса] Куст
	гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПСервера(ЭтаФорма,, ТекущийОбъект);
КонецПроцедуры

&НаСервере
&После("ПриЗаписиНаСервере")
Процедура гкс_ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// гкс+ [Часовые пояса] Куст 
	гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПКлиента(ЭтаФорма,, ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// гкс+ [Релиз 1] Куст
	ДобавитьНовыеЭлементы();
	
	// гкс+ [Часовые пояса] Куст
	гкс_ЧасовыеПоясаВызовСервера.ДобавитьНовыеЭлементы(ЭтаФорма, Элементы.ГруппаДатаОбнаружения,
		Новый Структура("гкс_РеквизитыДаты", 
		"Дата,ДатаОбнаружения,СписокДефектов.ДатаНачалаРемонта"));
		
	// гкс+ [Релиз 1] Куст 
	Элементы.СпособСогласования.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
КонецПроцедуры

&НаСервере
Процедура гкс_ПриЧтенииНаСервереПосле(ТекущийОбъект)
	// гкс+ [Часовые пояса] Куст
	СтруктураПроверки = Новый Структура("гкс_СдвигЧП", Неопределено);
	ЗаполнитьЗначенияСвойств(СтруктураПроверки, ЭтотОбъект);
	Если Не СтруктураПроверки.гкс_СдвигЧП = Неопределено Тогда 
		гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПКлиента(ЭтаФорма,, Объект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПередЗаписью")
Процедура гкс_ПередЗаписью(Отказ, ПараметрыЗаписи)
	#Вставка
	МассивСтруктур = новый Массив();
	МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "ДатаОбнаружения", НСтр("ru='Дата обнаружения';en='Detection date'")));
	МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "Организация", НСтр("ru='Организация';en='Organization'")));
	МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "Подразделение", НСтр("ru='Подразделение';en='Subdivision'")));
	МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "ОбъектРемонта", НСтр("ru='ФМ';en='FP'")));
	МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "гкс_Влияние", НСтр("ru='Влияние';en='Impact'")));
	МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "ДефектВыявленВПроцессе",
		НСтр("ru='Дефект выявлен в процессе';en='Defect detected in the process'")));
	// Гкс+[TOIR20-454] Зозуля А.В. от 09.10.2024. Добавлено:{
	Если Объект.гкс_ДефектОформленПоТАГ И Не ЗначениеЗаполнено(Объект.гкс_НомерТАГ) Тогда
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "гкс_НомерТАГ", НСтр("ru='Номер ТАГ';en='TAG number'")));		
	КонецЕсли;	
	// } Гкс-[TOIR20-454] Зозуля А.В. от 09.10.2024.	
		
	Для Каждого СтрокаМассива Из МассивСтруктур Цикл
		Если Не ЗначениеЗаполнено(Объект[СтрокаМассива.Имя]) Тогда 
			Сообщение = Новый СообщениеПользователю();
			ШаблонСообщения = НСтр("ru='Поле ""%1"" не заполнено';en='Field %1 is empty'");
			Сообщение.Текст = СтрШаблон(ШаблонСообщения, СтрокаМассива.Текст);
			Сообщение.Поле = "Объект." + СтрокаМассива.Имя;
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	Если Объект.СписокДефектов.Количество() = 0 Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='В документе не указан отказавший элемент';en='The document does not specify an failed item'");
		Сообщение.Сообщить();
		Отказ = Истина;
	Иначе
		МассивСтруктур = новый Массив();
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "ОтказавшийЭлемент",
			НСтр("ru='Отказавший элемент';en='Failed item'")));
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "КритичностьДефекта",
			НСтр("ru='Критичность дефекта';en='Defect criticality'")));
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "гкс_СимптомДефекта",
			НСтр("ru='Симптом дефекта';en='Symptom defect'")));
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "ДефектОписание",
			НСтр("ru='Дефект описание';en='Defect description'")));
		Для Каждого СтрокаМассива Из МассивСтруктур Цикл
			НомерПП = 0;
			Для Каждого СтрокаТаблицы Из Объект.СписокДефектов Цикл
				Если Не ЗначениеЗаполнено(СтрокаТаблицы[СтрокаМассива.Имя]) Тогда 
					Сообщение = Новый СообщениеПользователю();
					ШаблонСообщения = НСтр("ru='Поле ""%1"" не заполнено';en='Field %1 is empty'");
					Сообщение.Текст = СтрШаблон(ШаблонСообщения, СтрокаМассива.Текст);
					Сообщение.Поле = "Объект.СписокДефектов[" + НомерПП + "]." + СтрокаМассива.Имя;
					Сообщение.Сообщить();
					Отказ = Истина;
				КонецЕсли;
				НомерПП = НомерПП + 1;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	#КонецВставки

	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение
		И ФОИспользоватьГарантии Тогда
		торо_ГарантийноеОбслуживание.СформироватьПредупрежденияОРекламационныхАктах(Объект, "СписокДефектов");
	КонецЕсли; 
	#Вставка
	#Область ЕвоБланк
	Если 
		// гкс+ [10.23] Деснол 13.06.2024
		ЭтотОбъект["ПроведенЕвоБланк"] = Ложь И
		// записывают документ до проведения и не создают эвобланк. эту лазейку нужно закрыть
		ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И
		// гкс- [10.23] Деснол 13.06.2024
		гкс_ЕвоНуженПоВлиянию(Объект.гкс_Влияние) Тогда
		Если ЗначениеЗаполнено(ЭтотОбъект["СсылкаЕвоБланк"]) Тогда 
			// проверить проведенность
			СтруктураБланк = гкс_НайтиАктуальныйЕВО(Объект.Ссылка);
			ЭтотОбъект["СсылкаЕвоБланк"] = СтруктураБланк.Ссылка;
			ЭтотОбъект["ПроведенЕвоБланк"] = СтруктураБланк.Проведен;
			Если Не ЭтотОбъект["ПроведенЕвоБланк"] Тогда 
				Отказ = Истина;
				гкс_ОткрытьЕВО();
			КонецЕсли;
		Иначе
			Отказ = Истина;
			// Создать
			гкс_ОткрытьЕВО();
		КонецЕсли;
	КонецЕсли;
	#КонецОбласти
	#КонецВставки
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ОбработкаПроверкиЗаполненияНаСервере")
Процедура гкс_ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)

	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства

	#Вставка
	// Гкс+[TOIR20-158] Селимов
	ВнешнееОснованиеДляРабот = СозданНаОснованииВнешнегоОснованияДляРабот();  
	#КонецВставки 
	Индекс = 0;
	ШаблонСообщения = НСтр("es='%1';ru='Не заполнен объект ремонта в строке %1';en='Repair object not filled in line%1'");
	Для каждого Строка из ОбъектыРемонта Цикл
		Если НЕ ЗначениеЗаполнено(Строка.ОбъектРемонта) Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Индекс+1);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"ОбъектыРемонта["+Индекс+"].ОбъектРемонта",,Отказ);
		КонецЕсли;
		Индекс = Индекс+1;
	КонецЦикла;
	#Вставка
	// Гкс+[TOIR20-158] Селимов		 
	Индекс = 0;
	ШаблонСообщения = НСтр("es='%1';ru='Не указана критичность дефекта в строке %1';en='Defect criticality not filled in line%1'");
	Если ВнешнееОснованиеДляРабот Тогда 
		Для каждого Строка Из Объект.СписокДефектов Цикл
			Если Не ЗначениеЗаполнено(Строка.КритичностьДефекта) Тогда
				ТекстСообщения = СтрШаблон(ШаблонСообщения, Индекс+1);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ,
													"Объект.СписокДефектов[" + Индекс + "].КритичностьДефекта", , 
													Отказ);
			КонецЕсли; 			
			Индекс = Индекс+1;
		КонецЦикла; 		
	КонецЕсли; // Гкс-[TOIR20-158]
	#КонецВставки 

КонецПроцедуры 
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
&ИзменениеИКонтроль("СпособСогласованияПриИзменении")
Процедура гкс_СпособСогласованияПриИзменении(Элемент)
	Если фПослеОчистки = Ложь Тогда
		ОбновитьДеревоСогласующих(Истина);
		#Удаление
		торо_РаботаССогласованиямиКлиентСервер.ДобавитьСтрокуВИсториюСтатусов(ЭтаФорма, СтатусДокументаРегистр,, Истина);
		#КонецУдаления
		#Вставка
		торо_РаботаССогласованиямиКлиентСервер.ДобавитьСтрокуВИсториюСтатусов(ЭтаФорма, СтатусДокументаРегистр,,);
		#КонецВставки
	Иначе
		фПослеОчистки = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
// гкс+ [Релиз16] Деснол
&НаКлиенте
Процедура ОткрытьЗакрытиеЗаявокИРемонтов(Команда)
	Если Объект.Проведен = Ложь Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Необходимо провести документ';en='you need to post a document'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ВыбранныеРемонты = Новый Массив;
	Для каждого Ремонт Из Объект.СписокДефектов Цикл
		ВыбранныеРемонты.Добавить(Ремонт.ID);
	КонецЦикла; 
	
	Отбор = Новый Структура;
	Отбор.Вставить("ID", ВыбранныеРемонты);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОтборРемонтов", Отбор);
	ПараметрыФормы.Вставить("ТекущаяСтраница", "ГруппаАварийныеРемонты");
	
	ОткрытьФорму("Обработка.торо_ЗакрытиеЗаявокИРемонтов.Форма.Форма", ПараметрыФормы,,,,,,);
	
КонецПроцедуры
// гкс- [Релиз16]

// гкс+ [02.23] Деснол 07.02.2023
&НаКлиенте
Процедура гкс_ОткрытьПамятку1(Команда)
	ОткрытьФорму("Документ.торо_ВыявленныеДефекты.Форма.ПамяткаКритичность",,,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры // гкс- [02.23] Деснол 07.02.2023

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьНовыеЭлементы()
	МассивРеквизитов = Новый Массив();
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_СтатусЧерновик",
		Новый ОписаниеТипов("СправочникСсылка.торо_СтатусыСогласованияДокументовРемонтныхРабот")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ПодразделениеИсполнительЗаполненПользователем",
		Новый ОписаниеТипов("Булево")));	
	
	ИзменитьРеквизиты(МассивРеквизитов);
	// гкс+ [03.23] Деснол 13.03.2023
	Если Не РольДоступна("гкс_РедактированиеЗаявкиНаРемонт") Тогда 
		Элементы.Дата.ТолькоПросмотр = Истина;
	КонецЕсли;
	// гкс- [03.23] Деснол 13.03.2023
	ЭтаФорма["гкс_СтатусЧерновик"] = справочники.торо_СтатусыСогласованияДокументовРемонтныхРабот.Черновик;

	Элементы.ОбъектРемонта.Заголовок = НСтр("ru='ФМ';en='FP'");
	Элементы.ОбъектРемонта.АвтоОтметкаНезаполненного = Истина;
	Элементы.СписокДефектовСоздатьТиповойДефект.Доступность = Ложь;
	Элементы.СписокДефектовСоздатьТиповойДефект.Видимость = Ложь;
	Элементы.СписокДефектовТиповойДефект.Видимость = Ложь;
	Элементы.СписокДефектовВидДефекта.ТолькоПросмотр = Истина;
	Элементы.СписокДефектовДефектПричина.Видимость = Ложь;
	Элементы.СписокДефектовВидДефекта.АвтоОтметкаНезаполненного = Ложь;

	НЭлем = Элементы.Добавить("дс_ГруппаСимптом",Тип("ГруппаФормы"), Элементы.СписокДефектов);
	НЭлем.Вид = ВидГруппыФормы.ГруппаКолонок;
	НЭлем.Группировка = ГруппировкаКолонок.Вертикальная;
	Элементы.Переместить(Элементы["дс_ГруппаСимптом"],
		Элементы.СписокДефектов, Элементы.СписокДефектовТиповойДефект);

	НЭлем = Элементы.Добавить("СписокДефектовгкс_СимптомДефекта",Тип("ПолеФормы"), Элементы["дс_ГруппаСимптом"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.СписокДефектов.гкс_СимптомДефекта";
	// Гкс+[TOIR20-466] Зозуля А.В. от 07.11.2024. Добавлено:{
	НЭлем.АвтоОтметкаНезаполненного = Истина;
	// } Гкс-[TOIR20-466] Зозуля А.В. от 07.11.2024.
	
	НЭлем = Элементы.Добавить("гкс_Влияние",Тип("ПолеФормы"), Элементы.ГруппаЛевая);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.гкс_Влияние";
	НЭлем.АвтоМаксимальнаяШирина = Ложь;
	НЭлем.АвтоОтметкаНезаполненного = Истина;
	
	Элементы.Переместить(Элементы.СписокДефектовКритичностьДефекта, Элементы["дс_ГруппаСимптом"]);
	
	НЭлем = Элементы.Добавить("гкс_КорневаяПричина",Тип("ПолеФормы"),Элементы.ГруппаКолонокОписаниеДефекта);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.Заголовок = НСтр("ru='Корневая причина дефекта'
		|en='Root cause of defect'");
	НЭлем.ПутьКДанным = "Объект.СписокДефектов.гкс_КорневаяПричина";
	НЭлем.ТолькоПросмотр = Истина;
	
	Элементы.Подразделение.УстановитьДействие("ПриИзменении","ПодразделениеПриИзменении");
	
	НКом = Команды.Добавить("дс_ОтправитьНаСогласование");
	НКом.Действие = "дс_ОтправитьНаСогласование";
	НКом.Заголовок = НСтр("ru='Отправить на согласование';en='Send for approval'");
	НКноп = Элементы.Добавить("дс_ОтправитьНаСогласование",Тип("КнопкаФормы"),Элементы.ФормаКоманднаяПанель);
	НКноп.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НКноп.ИмяКоманды = "дс_ОтправитьНаСогласование";
	Элементы.Переместить(Элементы["дс_ОтправитьНаСогласование"],Элементы.ФормаКоманднаяПанель,Элементы.ФормаПроведение);
	дс_ИзменитьВидимостьКнопкиОтправкиНаСогласование();
	Элементы.СписокДефектовКритичностьДефекта.АвтоОтметкаНезаполненного = Истина;
	// гкс+ [07.23] Деснол 18.07.2023
	НГруп = Элементы.Добавить("гкс_СрочностьГруппа", Тип("ГруппаФормы"),Элементы.ГруппаПравая);
	НГруп.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	//НГруп.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НГруп.отображатьЗаголовок = Ложь;
	НГруп.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	// Гкс+[TOIR20-454] Зозуля А.В. от 09.10.2024. Добавлено:{
	НГруп.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
	// } Гкс-[TOIR20-454] Зозуля А.В. от 09.10.2024.
	//
	НЭлем = Элементы.Добавить("гкс_СрочностьВоздействия", Тип("ПолеФормы"), Элементы["гкс_СрочностьГруппа"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.гкс_СрочностьВоздействия";
	НЭлем.АвтоМаксимальнаяШирина = Ложь;
	НЭлем.ТолькоПросмотр = Истина;
	//
	НЭлем = Элементы.Добавить("гкс_КачественнаяОценка", Тип("ПолеФормы"), Элементы["гкс_СрочностьГруппа"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	// Гкс+[TOIR20-570/TOIR20-576] Зозуля А.В. от 14.04.2025. Добавлено:{
	//НЭлем.ПутьКДанным = "Объект.СписокДефектов.ОтказавшийЭлемент.гкс_КачественнаяОценка";
	//На:
	НЭлем.ПутьКДанным = "Объект.гкс_КачественнаяОценка";
	// } Гкс-[TOIR20-570/TOIR20-576] Зозуля А.В. от 14.04.2025.
	НЭлем.АвтоМаксимальнаяШирина = Ложь;
	НЭлем.ТолькоПросмотр = Истина;
	// гкс- [07.23] Деснол 18.07.2023
	// гкс+ [Релиз19] Деснол
	Если Не (РольДоступна("ПолныеПрава") 
		ИЛИ РольДоступна("гкс_РедактированиеЗаявкиНаРемонт")
		ИЛИ РольДоступна("Администрирование")) Тогда 
	// гкс- [Релиз19]
		Элементы.Ответственный.ТолькоПросмотр = Истина;
	КонецЕсли;
	Элементы.СписокДефектовОткрытьМатрицуОценкиРисков.Видимость = Ложь;
	// гкс+ [Релиз16] Деснол
	НоваяКомандаФормы = Команды.Добавить("ОткрытьЗакрытиеЗаявокИРемонтов");
	НоваяКомандаФормы.Действие = "ОткрытьЗакрытиеЗаявокИРемонтов";
	НоваяКомандаФормы.Заголовок = НСтр("ru='Закрытие заявок и ремонтов';en='Closing applications and repairs'");
	//
	НоваяКнопкаФормы = Элементы.Добавить("гкс_ОткрытьЗакрытиеЗаявокИРемонтов",Тип("КнопкаФормы"), Элементы.ФормаКоманднаяПанель);
	НоваяКнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НоваяКнопкаФормы.ИмяКоманды = "ОткрытьЗакрытиеЗаявокИРемонтов";
	Элементы.Переместить(Элементы["гкс_ОткрытьЗакрытиеЗаявокИРемонтов"],
		Элементы.ФормаКоманднаяПанель, Элементы.ФормаОбщаяКомандаДополнительныеСведенияКоманднаяПанель);
	// гкс- [Релиз16]
	// гкс+ [11.22] Деснол 03.11.2022
	НовыйЭлемент = Элементы.Вставить("гкс_ОРГруппа", Тип("ГруппаФормы"), Элементы.СписокДефектов, Элементы.СписокДефектовОтказавшийЭлемент);
	НовыйЭлемент.Вид = ВидГруппыФормы.ГруппаКолонок;
	//
	Элементы.Переместить(Элементы.СписокДефектовОтказавшийЭлемент, Элементы["гкс_ОРГруппа"]);
	//
	НовыйЭлемент = Элементы.Добавить("гкс_ОРТехНомер", Тип("ПолеФормы"), Элементы["гкс_ОРГруппа"]);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.СписокДефектов.ОтказавшийЭлемент.ТехНомер";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	// гкс- [11.22] Деснол 03.11.2022
	// гкс+ [02.23] Деснол 07.02.2023
	НоваяКомандаФормы = Команды.Добавить("гкс_Памятка1");
	НоваяКомандаФормы.Действие = "гкс_ОткрытьПамятку1";
	НоваяКомандаФормы.Заголовок = НСтр("ru='Как определить критичность';en='Defect criticality'");
	//
	НоваяКнопкаФормы = Элементы.Добавить("гкс_Памятка1Кнопка",Тип("КнопкаФормы"), Элементы.СписокДефектов.КоманднаяПанель);
	НоваяКнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НоваяКнопкаФормы.ИмяКоманды = "гкс_Памятка1";
	НоваяКнопкаФормы.Картинка = БиблиотекаКартинок.Справка;
	НоваяКнопкаФормы.Отображение = ОтображениеКнопки.КартинкаИТекст;
	// гкс- [02.23] Деснол 07.02.2023
	#Область ЕвоБланк
	МассРекв = Новый Массив();
	МассРекв.Добавить(Новый РеквизитФормы("СсылкаЕвоБланк", Новый ОписаниеТипов("ДокументСсылка.гкс_ЕВОБланк"),, "Ссылка ЕВО-бланк"));
	МассРекв.Добавить(Новый РеквизитФормы("ПроведенЕвоБланк", Новый ОписаниеТипов("Булево"),, "ЕВО-бланк проведен"));
	ИзменитьРеквизиты(МассРекв);
	
	Элементы["гкс_Влияние"].УстановитьДействие("ПриИзменении", "гкс_ВлияниеПриИзменении");
	СтруктураБланк = гкс_НайтиАктуальныйЕВО(Объект.Ссылка);
	ЭтотОбъект["СсылкаЕвоБланк"] = СтруктураБланк.Ссылка;
	ЭтотОбъект["ПроведенЕвоБланк"] = СтруктураБланк.Проведен;
	Если Объект.Дата > Дата(2023,11,1) Тогда
		Элементы.ГруппаСогласование.Доступность = СтруктураБланк.Проведен ИЛИ Объект.Проведен 
			ИЛИ Не гкс_ЕвоНуженПоВлиянию(Объект.гкс_Влияние);
	ИначеЕсли Объект.Дата > Дата(2000,1,1) Тогда
		ЭтотОбъект["ПроведенЕвоБланк"] = Истина;
	КонецЕсли;
	#КонецОбласти
	
	// Гкс+[TOIR20-454] Зозуля А.В. от 09.10.2024. Добавлено:{
	#Область ТАГ 
	НЭлем = ЭтаФорма.Элементы.Вставить("ДекорацияВыравнивания", Тип("ДекорацияФормы"), Элементы.ГруппаЛевая, Элементы.ОбъектРемонта);
	НЭлем.Вид = ВидДекорацииФормы.Надпись;
	//
	НГруп = Элементы.Вставить("гкс_ГруппаТАГ", Тип("ГруппаФормы"), Элементы.ГруппаПравая, Элементы.КонтактноеЛицоИнициатора);
	НГруп.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НГруп.ОтображатьЗаголовок = Ложь;
	НГруп.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НГруп.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
	//
	НЭлем = Элементы.Добавить("гкс_ДефектОформленПоТАГ", Тип("ПолеФормы"), Элементы["гкс_ГруппаТАГ"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.гкс_ДефектОформленПоТАГ";
	Элементы["гкс_ДефектОформленПоТАГ"].УстановитьДействие("ПриИзменении", "гкс_ДефектОформленПоТАГПриИзменении");
	//
	НЭлем = Элементы.Добавить("гкс_НомерТАГ", Тип("ПолеФормы"), Элементы["гкс_ГруппаТАГ"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.гкс_НомерТАГ";
	НЭлем.Маска = "99999999999999999999";	
	#КонецОбласти
	// } Гкс-[TOIR20-454] Зозуля А.В. от 09.10.2024.

    // Гкс+[TOIR20-466] Зозуля А.В. от 07.11.2024. Добавлено:{
	Элементы.СписокДефектовДефектОписание.АвтоОтметкаНезаполненного = Истина;
	// } Гкс-[TOIR20-466] Зозуля А.В. от 07.11.2024.
	
	НЭлем = Элементы.Добавить("гкс_ГруппаФайлыФиксации", Тип("ГруппаФормы"), Элементы.Группа5);
	НЭлем.Вид = ВидГруппыФормы.Страница;
	НЭлем.Заголовок = "Файлы фиксации";

	Элементы.Переместить(Элементы.гкс_ГруппаФайлыФиксации, Элементы.Группа5, Элементы.ГруппаКомиссия);  
		
	НЭлем	= Элементы.Добавить("гкс_ФайлыФиксации", Тип("ТаблицаФормы"), Элементы.гкс_ГруппаФайлыФиксации);	
	НЭлем.ПутьКДанным = "Объект.гкс_ФайлыФиксации";
	НЭлем.Отображение = ОтображениеТаблицы.Список;
	НЭлем.УстановитьДействие("Выбор", "гкс_Подключаемый_ФайлыФиксацииВыбор");
	
	НЭлем  = Элементы.Вставить("гкс_НомерСтроки", Тип("ПолеФормы"), Элементы.гкс_ФайлыФиксации);	
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;      
	НЭлем.ПутьКДанным = "Объект.гкс_ФайлыФиксации.НомерСтроки";

	НЭлем  = Элементы.Вставить("гкс_НаименованиеФайла", Тип("ПолеФормы"), Элементы.гкс_ФайлыФиксации);	
	НЭлем.Вид = ВидПоляФормы.ПолеНадписи; 
	НЭлем.Заголовок = "Файл";
	НЭлем.ГиперссылкаЯчейки  = Истина;
	НЭлем.Гиперссылка        = Истина;
	НЭлем.ЦветТекста = ЦветаСтиля.ГиперссылкаЦвет;
	НЭлем.ПутьКДанным = "Объект.гкс_ФайлыФиксации.НаименованиеФайла";
	
КонецПроцедуры

#Область ЕвоБланк

&НаСервереБезКонтекста
Функция гкс_ЕвоНуженПоВлиянию(Влияние)
	Возврат Не Влияние = Перечисления.гкс_Влияние.БезВлияния;
КонецФункции

&НаКлиенте
Процедура гкс_ОткрытьЕВО(ДопПараметры = Неопределено)
	Если Модифицированность Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Перед проведением, необходимо записать изменения";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	ОпОп = Новый ОписаниеОповещения("гкс_ПриЗакрытииЕВО", ЭтотОбъект);
	Если ЗначениеЗаполнено(ЭтотОбъект["СсылкаЕвоБланк"]) Тогда 
		СтруктураСоздания = Новый Структура("Ключ", ЭтотОбъект["СсылкаЕвоБланк"]);
	Иначе
		СтруктураСоздания = Новый Структура("ДокументОснование", Объект.Ссылка);
		СтруктураСоздания.Вставить("ДатаОбнаружения", Объект.ДатаОбнаружения);
		Если Объект.СписокДефектов.Количество() Тогда 
			СтруктураСоздания.Вставить("КорневаяПричина", Объект.СписокДефектов[0].гкс_КорневаяПричина);
			СтруктураСоздания.Вставить("ВидДефекта", Объект.СписокДефектов[0].ВидДефекта);
			СтруктураСоздания.Вставить("ДефектОписание", Объект.СписокДефектов[0].ДефектОписание);
		КонецЕсли;
	КонецЕсли;
	СтруктураСоздания.Вставить("Организация", Объект.Организация);
	СтруктураСоздания.Вставить("Подразделение", Объект.Подразделение);
	ОткрытьФорму("Документ.гкс_ЕВОБланк.ФормаОбъекта", СтруктураСоздания,,,,, ОпОп);
КонецПроцедуры

&НаКлиенте
Процедура гкс_ПриЗакрытииЕВО(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда 
		Прочитать();
		// найти актуальный ЕВО
		СтрОтвет = гкс_НайтиАктуальныйЕВО(Объект.Ссылка);
		ЭтотОбъект["СсылкаЕвоБланк"] = СтрОтвет.Ссылка;
		ЭтотОбъект["ПроведенЕвоБланк"] = СтрОтвет.Проведен;
		Если Объект.Дата > Дата(2023,11,1) Тогда
			Элементы.ГруппаСогласование.Доступность = ЭтотОбъект["ПроведенЕвоБланк"] ИЛИ Объект.Проведен 
				ИЛИ Не гкс_ЕвоНуженПоВлиянию(Объект.гкс_Влияние);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура гкс_ВлияниеПриИзменении(Элемент)
	Если Объект.Дата > Дата(2023,11,1) Тогда
		Элементы.ГруппаСогласование.Доступность = ЭтотОбъект["ПроведенЕвоБланк"] ИЛИ Объект.Проведен ИЛИ Не гкс_ЕвоНуженПоВлиянию(Объект.гкс_Влияние);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция гкс_НайтиАктуальныйЕВО(СсылкаВД)
	Ответ = Новый Структура("Ссылка,Проведен", Неопределено, Ложь);
	Если Не ЗначениеЗаполнено(СсылкаВД) Тогда 
		Возврат Ответ;
	КонецЕсли;
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	гкс_ЕВОБланк.Проведен КАК Проведен,
		|	гкс_ЕВОБланк.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.гкс_ЕВОБланк КАК гкс_ЕВОБланк
		|ГДЕ
		|	гкс_ЕВОБланк.ДокументОснование = &СсылкаВД
		|	И гкс_ЕВОБланк.ПометкаУдаления = Ложь";
	
	Запрос.УстановитьПараметр("СсылкаВД", СсылкаВД);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат Ответ;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Ответ.Ссылка = Выборка.Ссылка;
		Ответ.Проведен = Выборка.Проведен;
		Возврат Ответ;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура гкс_ОткрытьЕВО_ЧерезСекунду() Экспорт
	гкс_ОткрытьЕВО();
КонецПроцедуры

#КонецОбласти

&НаСервереБезКонтекста
Функция ЭтоФМ(Ссылка, ИскатьФМ = Истина)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ОбъектыРемонта.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|ГДЕ
		|	торо_ОбъектыРемонта.Ссылка = &Ссылка
		|	И торо_ОбъектыРемонта.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто)
		|	И торо_ОбъектыРемонта.ЭтоГруппа = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);          
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() = Ложь Тогда 
		Возврат Истина;
	КонецЕсли;
	Если ИскатьФМ = Истина Тогда 
		ТекущееФункциональноеМесто = гкс_ПроверкаФункциональныхМест.НайтиФМ(Ссылка);
		Если ЗначениеЗаполнено(ТекущееФункциональноеМесто) И Не ТекущееФункциональноеМесто = Ссылка Тогда 
			Ссылка = ТекущееФункциональноеМесто;
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

&НаКлиенте
&ИзменениеИКонтроль("ОбъектРемонтаПриИзменении")
Процедура гкс_ОбъектРемонтаПриИзменении(Элемент)
	#Вставка
	Если Не ЭтоФМ(Объект.ОбъектРемонта) Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = Строка(Объект.ОбъектРемонта) 
			+ НСтр("ru=' является объектом ремонта. Выберите функциональное место'");
		Сообщение.Сообщить();
		Объект.ОбъектРемонта = Неопределено;
		Возврат;
	КонецЕсли;
	#КонецВставки
	ОчиститьСписокДефектов();
	ОбъектыРемонта.Очистить();

	нс = ОбъектыРемонта.Добавить();
	нс.ОбъектРемонта = Объект.ОбъектРемонта;

	ТекущийОР = Объект.ОбъектРемонта;

	#Удаление 
    Объект.ПодразделениеИсполнитель = ПолучитьПодразделениеДляОР(Объект.ОбъектРемонта);
	#КонецУдаления 

	Элементы.СписокДефектов.ОтборСтрок = Неопределено;
	Элементы.СписокДефектов.ОтборСтрок = Новый ФиксированнаяСтруктура("ОбъектРемонта", Объект.ОбъектРемонта);
	Элементы.СписокДефектов.Доступность = ЗначениеЗаполнено(Объект.ОбъектРемонта);

КонецПроцедуры

&НаКлиенте
Процедура гкс_СписокДефектовОтказавшийЭлементПриИзмененииВместо()
	
	гкс_СписокДефектовОтказавшийЭлементПриИзмененииНаСервере();

КонецПроцедуры

&НаСервере
Процедура гкс_СписокДефектовОтказавшийЭлементПриИзмененииНаСервере() 
	
	ИдентификаторСтроки = Элементы.СписокДефектов.ТекущаяСтрока;
	ТекДанные = Объект.СписокДефектов.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если ЭтоФМ(ТекДанные.ОтказавшийЭлемент,Ложь) Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Отказавшим элементом не должно быть функциональое место!'");
		Сообщение.Сообщить();
		ТекДанные.ОтказавшийЭлемент = Неопределено;
		Возврат;
	КонецЕсли;
	Если Не ТекДанные.ОтказавшийЭлемент = ПредопределенноеЗначение("Справочник.торо_ОбъектыРемонта.ПустаяСсылка") Тогда
		ТекДанные.ТиповойДефект = ПредопределенноеЗначение("Справочник.торо_ТиповыеДефектыОборудования.ПустаяСсылка");
		ТекДанные.НаправлениеОтказавшийЭлемент = 
			торо_ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ТекДанные.ОтказавшийЭлемент, "Направление");
	КонецЕсли;
	
	// Гкс+[TOIR20-570/TOIR20-576] Зозуля А.В. от 14.04.2025. Добавлено:{
	Если ЗначениеЗаполнено(ТекДанные.КритичностьДефекта) Тогда
		СтруктураОтвета = гкс_МаксимальнаяСрочностьВоздействияИКачественнаяОценка(Объект.СписокДефектов);
		Объект.гкс_СрочностьВоздействия = СтруктураОтвета.СрочностьВоздействия;
		Объект.гкс_КачественнаяОценка = СтруктураОтвета.КачественнаяОценка;
	КонецЕсли;	
	// } Гкс-[TOIR20-570/TOIR20-576] Зозуля А.В. от 14.04.2025.
	
	Если ЭтотОбъект["гкс_ПодразделениеИсполнительЗаполненПользователем"] Тогда	
		ТекДанные.ПодразделениеИсполнитель = Объект.ПодразделениеИсполнитель;		
	Иначе						
		МассивОтказавшихЭлементов = Новый Массив;
		Для Каждого Строка Из Объект.СписокДефектов Цикл
			МассивОтказавшихЭлементов.Добавить(Строка.ОтказавшийЭлемент);	
		КонецЦикла;	
			
		ПодразделенияИсполнителиОтказавшихЭлементов = 
			ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивОтказавшихЭлементов, "ПодразделениеИсполнитель");
		Для Каждого Строка Из Объект.СписокДефектов Цикл
			ЭлементСоответствия = ПодразделенияИсполнителиОтказавшихЭлементов.Получить(Строка.ОтказавшийЭлемент); 
			Строка.ПодразделениеИсполнитель = ЭлементСоответствия.ПодразделениеИсполнитель;	
		КонецЦикла;
		
		ТаблицаПодразделений = Объект.СписокДефектов.Выгрузить(,"ПодразделениеИсполнитель");;
		ТаблицаПодразделений.Свернуть("ПодразделениеИсполнитель");
		Если ТаблицаПодразделений.Количество() = 1 Тогда
			Объект.ПодразделениеИсполнитель = ТаблицаПодразделений[0].ПодразделениеИсполнитель;
		Иначе
			Объект.ПодразделениеИсполнитель = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
&После("ПодразделениеИсполнительПриИзменении")
Процедура гкс_ПодразделениеИсполнительПриИзменении(Элемент)
	ЭтотОбъект["гкс_ПодразделениеИсполнительЗаполненПользователем"] = 
		ЗначениеЗаполнено(Объект.ПодразделениеИсполнитель);
	ПодразделениеПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	Если ЭтотОбъект["мИспользоватьСогласованиеДокументов"] И Элементы["СпособСогласования"].ТолькоПросмотр
		И Не СтатусДокументаРегистр = ЭтаФорма["гкс_СтатусЧерновик"] Тогда 
		Возврат;
	КонецЕсли;
	//
	Если Объект.СписокДефектов.Количество() > 0 Тогда 
		// гкс+ [2021] Куст
		Способ = гкс_ПолучитьСпособСогласования(Объект.Организация, Объект.СписокДефектов[0].ОтказавшийЭлемент,
			Объект.ПодразделениеИсполнитель, Объект.Ссылка);// гкс- [2021]		
		Если ЗначениеЗаполнено(Способ) И Не Объект.СпособСогласования = Способ Тогда 
			Объект.СпособСогласования = Способ;
			СпособСогласованияПриИзменении(Неопределено);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция гкс_ПолучитьСпособСогласования(Орг, ОР, ПодрИсп, ОбъектСсылка = Неопределено)
	// гкс+ [2021] Куст
	Если торо_РаботаССогласованиями.гкс_ПоДокументуЕстьИстория(ОбъектСсылка) Тогда 
		Возврат Неопределено;
	КонецЕсли; // гкс- [2021]
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ОбъектыРемонта.Подразделение КАК Подразделение
		|ИЗ
		|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|ГДЕ
		|	торо_ОбъектыРемонта.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ОР);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат торо_РаботаССогласованиями.гкс_ПолучитьСпособСогласованияПоУмолчанию(
		Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_ВыявленныеДефекты,
		Орг, Выборка.Подразделение, ПодрИсп);
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

&НаКлиенте
&После("СписокДефектовОтказавшийЭлементПриИзменении")
Процедура гкс_СписокДефектовОтказавшийЭлементПриИзменении(Элемент)
	ПодразделениеПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура гкс_ОрганизацияПриИзмененииПосле(Элемент)
	ПодразделениеПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура гкс_СписокДефектовПриОкончанииРедактированияПосле(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если не ОтменаРедактирования Тогда 
		ПодразделениеПриИзменении(Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура гкс_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	дс_ИзменитьВидимостьКнопкиОтправкиНаСогласование();
КонецПроцедуры

&НаКлиенте
Процедура дс_ОтправитьНаСогласование(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Параметры1 = Новый Структура("дс_Выполнить", Истина);
		Параметры2 = Новый Структура();
		
		гкс_ОбщегоНазначенияСервер.ОтправитьНаСогласованиеНаСервере(Параметры1, Параметры2);
		Если Параметры1.дс_Выполнить Тогда 
			Параметры2.Вставить("Форма", ЭтаФорма);
			торо_РаботаССогласованиямиКлиент.ВыбратьСтатусЗавершение(Параметры1, Параметры2);
			дс_ИзменитьВидимостьКнопкиОтправкиНаСогласование();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура дс_ИзменитьВидимостьКнопкиОтправкиНаСогласование()
	гкс_ОбщегоНазначенияСервер.ИзменитьВидимостьКнопкиОтправкиНаСогласование(Элементы["дс_ОтправитьНаСогласование"],СтатусДокументаРегистр);
КонецПроцедуры

// гкс+ [8220] Тарасов
&НаКлиенте
Процедура гкс_СписокДефектовКритичностьДефектаПриИзмененииПосле(Элемент)
	// Гкс+[TOIR20-570/TOIR20-576] Зозуля А.В. от 14.04.2025. Изменено:{
	//ТекущиеДанные = Элементы.СписокДефектов.ТекущиеДанные;
	//Если НЕ ТекущиеДанные = Неопределено Тогда 
	//	Объект.гкс_СрочностьВоздействия = ПолучитьСрочностьВоздействия(ТекущиеДанные.ОтказавшийЭлемент, ТекущиеДанные.КритичностьДефекта); 
	//КонецЕсли;
	//На:
	СтруктураОтвета = гкс_МаксимальнаяСрочностьВоздействияИКачественнаяОценка(Объект.СписокДефектов);
	Объект.гкс_СрочностьВоздействия = СтруктураОтвета.СрочностьВоздействия;
	Объект.гкс_КачественнаяОценка = СтруктураОтвета.КачественнаяОценка;
	// } Гкс-[TOIR20-570/TOIR20-576] Зозуля А.В. от 14.04.2025.
КонецПроцедуры 

// гкс+ [8220] Тарасов
// Гкс+[TOIR20-570/TOIR20-576] Зозуля А.В. от 14.04.2025. Изменено:{
//&НаСервере
//Функция ПолучитьСрочностьВоздействия(ОбъектРемонта, КритичностьДефекта)
//На:
&НаСервереБезКонтекста
Функция гкс_МаксимальнаяСрочностьВоздействияИКачественнаяОценка(Знач СписокДефектов)
// } Гкс-[TOIR20-570/TOIR20-576] Зозуля А.В. от 14.04.2025.

	// Гкс+[TOIR20-570/TOIR20-576] Зозуля А.В. от 14.04.2025. Изменено:{	
	//Запрос = Новый Запрос;
	//// гкс+ [07.23] Деснол 17.07.2023
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	торо_ОбъектыРемонта.гкс_КатегорияРиска КАК КатегорияРиска
	//	|	,торо_ОбъектыРемонта.гкс_КачественнаяОценка КАК гкс_КачественнаяОценка
	//	|ПОМЕСТИТЬ ВТ_ДанныеОбъектаРемонта
	//	|ИЗ
	//	|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	//	|ГДЕ
	//	|	торо_ОбъектыРемонта.Ссылка = &ОбъектРемонта
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//     |	гкс_СрочностьВоздействия.СрочностьВоздействия КАК СрочностьВоздействия,
	//     |	2 КАК Приоритет
	//     |ПОМЕСТИТЬ ВТ_СПриоритетом
	//     |ИЗ
	//     |	ВТ_ДанныеОбъектаРемонта КАК ВТ_ДанныеОбъектаРемонта
	//     |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СрочностьВоздействия КАК гкс_СрочностьВоздействия
	//     |		ПО ВТ_ДанныеОбъектаРемонта.КатегорияРиска = гкс_СрочностьВоздействия.КатегорияРиска
	//     |			И (ЗНАЧЕНИЕ(Перечисление.гкс_КачественнаяОценкаКритичности.ПустаяСсылка) = гкс_СрочностьВоздействия.гкс_КачественнаяОценка)
	//     |ГДЕ
	//     |	гкс_СрочностьВоздействия.КритичностьДефекта = &КритичностьДефекта
	//     |
	//     |ОБЪЕДИНИТЬ ВСЕ
	//     |
	//     |ВЫБРАТЬ
	//     |	гкс_СрочностьВоздействия.СрочностьВоздействия,
	//     |	1
	//     |ИЗ
	//     |	ВТ_ДанныеОбъектаРемонта КАК ВТ_ДанныеОбъектаРемонта
	//     |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СрочностьВоздействия КАК гкс_СрочностьВоздействия
	//     |		ПО ВТ_ДанныеОбъектаРемонта.КатегорияРиска = гкс_СрочностьВоздействия.КатегорияРиска
	//     |			И (ВТ_ДанныеОбъектаРемонта.гкс_КачественнаяОценка = гкс_СрочностьВоздействия.гкс_КачественнаяОценка)
	//     |ГДЕ
	//     |	гкс_СрочностьВоздействия.КритичностьДефекта = &КритичностьДефекта
	//     |;
	//     |
	//     |////////////////////////////////////////////////////////////////////////////////
	//     |ВЫБРАТЬ
	//     |	ВТ_СПриоритетом.СрочностьВоздействия КАК СрочностьВоздействия,
	//     |	ВТ_СПриоритетом.Приоритет КАК Приоритет
	//     |ИЗ
	//     |	ВТ_СПриоритетом КАК ВТ_СПриоритетом
	//     |
	//     |УПОРЯДОЧИТЬ ПО
	//     |	Приоритет";
	//	// гкс- [07.23] Деснол 17.07.2023
	//
	//Запрос.УстановитьПараметр("ОбъектРемонта", 		ОбъектРемонта);
	//Запрос.УстановитьПараметр("КритичностьДефекта", КритичностьДефекта);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//Если НЕ РезультатЗапроса.Пустой() Тогда
	//	Выборка = РезультатЗапроса.Выбрать();
	//	Выборка.Следующий();
	//	Возврат Выборка.СрочностьВоздействия;
	//КонецЕсли;
	//
	//Возврат Перечисления.гкс_СрочностьВоздействия.ПустаяСсылка();
	//На:
	ДанныеТабличнойЧасти = Новый ТаблицаЗначений;
	ДанныеТабличнойЧасти.Колонки.Добавить("ОтказавшийЭлемент", Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта")); 
	ДанныеТабличнойЧасти.Колонки.Добавить("КритичностьДефекта", Новый ОписаниеТипов("СправочникСсылка.торо_КритичностьДефекта"));
	Для Каждого ТекСтрока Из СписокДефектов Цикл
		НоваяСтрока = ДанныеТабличнойЧасти.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
	КонецЦикла;	
		
	Возврат Документы.торо_ВыявленныеДефекты.гкс_МаксимальнаяСрочностьВоздействияИКачественнаяОценка(ДанныеТабличнойЧасти);
	// } Гкс-[TOIR20-570/TOIR20-576] Зозуля А.В. от 14.04.2025.
	
КонецФункции // гкс- [8220]

// Гкс+[TOIR20-158] Селимов
&НаСервере
Функция СозданНаОснованииВнешнегоОснованияДляРабот()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ИСТИНА КАК Поле1
		|ИЗ
		|	Документ.торо_ВыявленныеДефекты.ДокументыОснования КАК ДокОснования
		|ГДЕ
		|	ДокОснования.Ссылка = &Ссылка
		|	И ДокОснования.ДокументОснование ССЫЛКА Документ.торо_ВнешнееОснованиеДляРабот";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции // Гкс-[TOIR20-158] 

&НаКлиенте
&ИзменениеИКонтроль("СпособСогласованияНачалоВыбора")
Процедура гкс_СпособСогласованияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	Если СогласующиеРегистр.Количество() > 0 Тогда

		СтандартнаяОбработка = Ложь;

		ПоказатьВопрос(Новый ОписаниеОповещения("СпособСогласованияНачалоВыбораЗавершение",ЭтотОбъект,Новый Структура("Элемент",Элемент)),
		НСтр("es='¡Los datos de los estatus establecidos del documento serán limpiados! ¿Continuar?';ru='Данные по установленным статусам документа будут очищены! Продолжить?';en='Data on the established statuses of the document will be cleared! Continue?'"),
		РежимДиалогаВопрос.ДаНет);

	КонецЕсли;
	#Вставка
	// гкс+ [Релиз 1] Куст
	СтандартнаяОбработка = Ложь;
	ДопПараметры = Новый Структура("Отбор", Новый Структура("ПометкаУдаления", Ложь));
	ОткрытьФорму("Справочник.торо_СпособыСогласованияДокументов.ФормаВыбора",ДопПараметры,
	Элемент, , , , , РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	#КонецВставки

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("СпособСогласованияНачалоВыбораЗавершение")
Процедура гкс_СпособСогласованияНачалоВыбораЗавершение(РезультатВопроса, ДополнительныеПараметры)

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СогласующиеРегистр.Очистить();
		Если мХранитьИсториюСогласованияВДокументах Тогда
			Объект.Согласующие.Очистить();
		КонецЕсли;
		#Вставка
		// гкс+ [Релиз 1] Куст
		ДопПараметры = Новый Структура("Отбор", Новый Структура("ПометкаУдаления", Ложь));
		ОткрытьФорму("Справочник.торо_СпособыСогласованияДокументов.ФормаВыбора",ДопПараметры,
		ДополнительныеПараметры.Элемент, , , , , РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		#КонецВставки
		#Удаление
		ОткрытьФорму("Справочник.торо_СпособыСогласованияДокументов.ФормаВыбора",,ДополнительныеПараметры.Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		#КонецУдаления
	КонецЕсли;

КонецПроцедуры

// гкс+ [10.23] Деснол 13.06.2024
&НаКлиенте
&Вместо("ОбъектРемонтаНачалоВыбора")
Процедура гкс_ОбъектРемонтаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СписокДоступныхСтатусов = торо_СтатусыОРВУчете.СписокСтатусовДляПодбора();
	// Гкс+[TOIR20-563] Зозуля А.В. от 01.04.2025. Добавлено:{
	Если Не ЗначениеЗаполнено(Объект.Организация) Или Не ЗначениеЗаполнено(Объект.Подразделение) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните поля: Организация и Подразделение!");
		Возврат;
	КонецЕсли;	
	// } Гкс-[TOIR20-563] Зозуля А.В. от 01.04.2025.

	ПараметрыОтбора = Новый Структура("СписокСтатусов", СписокДоступныхСтатусов);
	ПараметрыОтбора.Вставить("СтруктураИерархии",       ТекСтруктураИерархии);
	ПараметрыОтбора.Вставить("ТекущаяСтрока",       Объект.ОбъектРемонта);
	// Гкс+[TOIR20-563] Зозуля А.В. от 01.04.2025. Добавлено:{
	ПараметрыОтбора.Вставить("Организация",       Объект.Организация);
	ПараметрыОтбора.Вставить("Подразделение",       Объект.Подразделение);
	// } Гкс-[TOIR20-563] Зозуля А.В. от 01.04.2025.
	
	ОткрытьФорму("Справочник.торо_ОбъектыРемонта.ФормаВыбора",ПараметрыОтбора,Элемент,,ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры // гкс- [10.23] Деснол 13.06.2024

// гкс+ [10.23] Деснол 14.06.2024
&НаКлиенте
Процедура гкс_ПослеЗаписиПосле(ПараметрыЗаписи)
	Если ЭтотОбъект["ПроведенЕвоБланк"] = Ложь И
		// записывают документ до проведения и не создают эвобланк. эту лазейку нужно закрыть
		гкс_ЕвоНуженПоВлиянию(Объект.гкс_Влияние) Тогда
		Если ЗначениеЗаполнено(ЭтотОбъект["СсылкаЕвоБланк"]) Тогда 
			// проверить проведенность
			СтруктураБланк = гкс_НайтиАктуальныйЕВО(Объект.Ссылка);
			ЭтотОбъект["СсылкаЕвоБланк"] = СтруктураБланк.Ссылка;
			ЭтотОбъект["ПроведенЕвоБланк"] = СтруктураБланк.Проведен;
			Если Не ЭтотОбъект["ПроведенЕвоБланк"] Тогда 
				гкс_ОткрытьЕВО();
			КонецЕсли;
		Иначе
			// Создать
			гкс_ОткрытьЕВО();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // гкс- [10.23] Деснол 14.06.2024

// гкс+ [10.23] Деснол 17.06.2024
&НаКлиенте
&Вместо("УтвердитьСтатус")
Процедура гкс_УтвердитьСтатус(Команда)
	Если Не ЭтотОбъект["ПроведенЕвоБланк"] И гкс_ЕвоНуженПоВлиянию(Объект.гкс_Влияние) Тогда 
		ПодключитьОбработчикОжидания("гкс_ОткрытьЕВО_ЧерезСекунду", 1, Истина);
		Возврат;
	КонецЕсли;
	//
	ПродолжитьВызов(Команда);
КонецПроцедуры // гкс- [10.23] Деснол 17.06.2024

// гкс+ [10.23] Деснол 17.06.2024
&НаКлиенте
Процедура гкс_ОбъектыРемонтаОбъектРемонтаНачалоВыбораВместо(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СписокДоступныхСтатусов = торо_СтатусыОРВУчете.СписокСтатусовДляПодбора();

	ОРПередВыбором = Элементы.ОбъектыРемонта.ТекущиеДанные.ОбъектРемонта;
	
	ПараметрыОтбора = Новый Структура("СписокСтатусов", СписокДоступныхСтатусов);
	ПараметрыОтбора.Вставить("СтруктураИерархии", ТекСтруктураИерархии);
	Если ЗначениеЗаполнено(ОРПередВыбором) Тогда 
		ПараметрыОтбора.Вставить("ТекущаяСтрока", ОРПередВыбором);
	Иначе
		ПараметрыОтбора.Вставить("ТекущаяСтрока", Объект.ОбъектРемонта);
	КонецЕсли;
		
	ОткрытьФорму("Справочник.торо_ОбъектыРемонта.ФормаВыбора",ПараметрыОтбора,Элемент,,ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры // гкс- [10.23] Деснол 17.06.2024

// гкс+ [10.23] Деснол 17.06.2024
&НаКлиенте
Процедура гкс_СписокДефектовОтказавшийЭлементНачалоВыбораВместо(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СписокДоступныхСтатусов = торо_СтатусыОРВУчете.СписокСтатусовДляПодбора();

	ОРПередВыбором = Элементы.СписокДефектов.ТекущиеДанные.ОтказавшийЭлемент;
	
	ПараметрыОтбора = Новый Структура("СписокСтатусов", СписокДоступныхСтатусов);
	ПараметрыОтбора.Вставить("СтруктураИерархии", ТекСтруктураИерархии);
	Если ЗначениеЗаполнено(ОРПередВыбором) Тогда 
		ПараметрыОтбора.Вставить("ТекущаяСтрока", ОРПередВыбором);
	Иначе
		ПараметрыОтбора.Вставить("ТекущаяСтрока", Объект.ОбъектРемонта);
	КонецЕсли;
	ПараметрыОтбора.Вставить("ОтборОбъектРемонта", Объект.ОбъектРемонта);
		
	ОткрытьФорму("Справочник.торо_ОбъектыРемонта.ФормаВыбора", ПараметрыОтбора, Элемент,, ВариантОткрытияОкна.ОтдельноеОкно,,, 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры // гкс- [10.23] Деснол 17.06.2024

// Гкс+[TOIR20-454] Зозуля А.В. от 09.10.2024. Добавлено:{
&НаКлиенте
Процедура гкс_ДефектОформленПоТАГПриИзменении(Элемент)
	Элементы.гкс_НомерТАГ.АвтоОтметкаНезаполненного = Объект.гкс_ДефектОформленПоТАГ;	
	Элементы.гкс_НомерТАГ.Доступность = Объект.гкс_ДефектОформленПоТАГ;
	Если Не Объект.гкс_ДефектОформленПоТАГ Тогда
		Объект.гкс_НомерТАГ = "";
	КонецЕсли;	
КонецПроцедуры // } Гкс-[TOIR20-454] Зозуля А.В. от 09.10.2024.	

&НаКлиенте
Процедура гкс_СписокДефектовПослеУдаленияПосле(Элемент)
	
	// Гкс+[TOIR20-570/TOIR20-576] Зозуля А.В. от 14.04.2025. Добавлено:{
	СтруктураОтвета = гкс_МаксимальнаяСрочностьВоздействияИКачественнаяОценка(Объект.СписокДефектов);
	Объект.гкс_СрочностьВоздействия = СтруктураОтвета.СрочностьВоздействия;
	Объект.гкс_КачественнаяОценка = СтруктураОтвета.КачественнаяОценка;
	// } Гкс-[TOIR20-570/TOIR20-576] Зозуля А.В. от 14.04.2025.
	
КонецПроцедуры
	
&НаКлиенте
Процедура гкс_Подключаемый_ФайлыФиксацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

#Если ВебКлиент Тогда
	ВызватьИсключение НСтр("ru='Просмотр файлов недоступно при работе в веб-клиенте.'");
#Иначе
	
	Попытка
		ТекущиеДанные = Элемент.ТекущиеДанные;
		НаименованиеФайла = ТекущиеДанные.НаименованиеФайла;
		АдресХраненияФайлов = гкс_АдресХраненияФайловФиксации() ;
		ВебСсылка = СтрШаблон("%1%2", АдресХраненияФайлов, ТекущиеДанные.ИдентификаторФайла);

		Если Поле.ГиперссылкаЯчейки И ЗначениеЗаполнено(ВебСсылка) Тогда
			СтандартнаяОбработка = Ложь; 
			СимволыРасширенияФайла = 4;
			РасширениеФайла = Прав(НаименованиеФайла, СимволыРасширенияФайла);  			
			
			ПараметрыПолучения = ПолучениеФайловИзИнтернетаКлиентСервер.ПараметрыПолученияФайла();
			ПараметрыПолучения.ПутьДляСохранения = ПолучитьИмяВременногоФайла(РасширениеФайла);
			Таймаут = 30;
			ПараметрыПолучения.Таймаут = Таймаут;

			Результат = ПолучениеФайловИзИнтернетаКлиент.СкачатьФайлНаКлиенте(ВебСсылка, ПараметрыПолучения);
			ЗапуститьПриложение(Результат.Путь);						
		КонецЕсли;
		
	Исключение
		ТекстСообщения = СтрШаблон(НСтр("ru ='Ошибка при переходе по веб-ссылке: %1'"),
			ОписаниеОшибки());
		гкс_ЗаписатьОшибкуВЖурналРегистрации(ТекстСообщения);
		
		ТекстСообщения = СтрШаблон(НСтр("ru ='Ошибка перехода по ссылке: %1'"), ОписаниеОшибки());
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
				
	КонецПопытки;

#КонецЕсли	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция гкс_АдресХраненияФайловФиксации() 
	
	Возврат Константы.гкс_АдресХраненияФайловФиксации.Получить();
	
КонецФункции	

&НаСервереБезКонтекста
Процедура гкс_ЗаписатьОшибкуВЖурналРегистрации(ТекстСообщения)
   
	ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка, 
		Метаданные.Документы.торо_ВыявленныеДефекты);   
    	
КонецПроцедуры

#КонецОбласти
